app/controllers/greetings_controller.rb

    def index
        @greetings = Greeting.all.sample
---
SELECT "greetings".* FROM "greetings"